In [4]:
from pydataset import data
import pandas as pd
import numpy as np
import matplotlib as plt
import env
from env import host, user, password

In [ ]:
# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

In [30]:
# cd into your exercises folder for this module and run echo env.py >> .gitignore
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [31]:
# Create a function named get_db_url. It should accept a username, hostname, password, and 
# database name and return a url connection string formatted like in the example at the start of this lesson.

def get_db_url(username, hostname, password, database):
    url = f'mysql+pymysql://{username}:{password}@{hostname}/{database}'
    return url

In [32]:
# Use your function to obtain a connection to the employees database.
url = get_db_url(user, host, password, 'employees')

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [33]:
# Once you have successfully run a query:
# a. Intentionally make a typo in the database url. What kind of error message do you see?

# connection error

In [34]:
# b. Intentionally make an error in your SQL query. What does the error message look like?

# query error

In [42]:
# Read the employees and titles tables into two separate DataFrames.

employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

In [38]:
#How many rows and columns do you have in each DataFrame? Is that what you expected?

employees_df.shape
titles_df.shape

(443308, 4)

In [40]:
# Display the summary statistics for each DataFrame.

employees_df.describe()
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [43]:
# How many unique titles are in the titles DataFrame?

len(pd.read_sql('SELECT DISTINCT title FROM titles', url))

7

In [51]:
# What is the oldest date in the to_date column?

oldest_to_date = (pd.read_sql('SELECT min(to_date) FROM titles', url))
oldest_to_date

  min(to_date)
0   1985-03-01

In [52]:
# What is the most recent date in the to_date column?

most_recent_to_date = (pd.read_sql('SELECT max(to_date) FROM titles WHERE to_date < NOW()', url))
most_recent_to_date

  max(to_date)
0   2002-08-01